{
  "courses": [
    {
      "title": "Fiqh of Worship - Comprehensive Islamic Jurisprudence",
      "slug": "fiqh-of-worship-comprehensive-islamic-jurisprudence",
      "description": "Master the essential Islamic rulings (fiqh) related to worship acts including prayer, fasting, zakat, and hajj. This comprehensive 30-week course provides detailed Fiqh rulings backed by evidence from the Quran and authentic Hadith. Learn the correct methodologies, differences of opinion among scholars, and practical applications for American Muslims navigating contemporary challenges.",
      "age_tier": "adults",
      "subject": "fiqh",
      "difficulty": "intermediate",
      "duration_weeks": 30,
      "schedule": "2 lessons per week, 30-40 minutes each",
      "instructor": "Sheikh Abdullah Al-Faqih",
      "is_featured": true,
      "prerequisites": "Basic Islamic knowledge and understanding of prayer basics",
      "learning_outcomes": [
        "Comprehensive knowledge of Islamic jurisprudence for acts of worship",
        "Ability to derive rulings from Quran and Hadith evidence",
        "Understanding of different madhahib (schools of thought) perspectives",
        "Practical application of fiqh in American Muslim context",
        "Confidence in performing worship acts with correct understanding",
        "Skills to research and understand scholarly opinions on worship matters"
      ],
      "publishedAt": "2025-01-15T00:00:00.000Z"
    },
    {
      "title": "Practical Fiqh for Daily Life",
      "slug": "practical-fiqh-for-daily-life",
      "description": "Navigate everyday Islamic rulings with confidence through this practical 18-week beginner course. Learn the fiqh of daily activities including purification, eating and drinking, dress code, family relations, business transactions, and social interactions. Each lesson provides clear rulings with Quranic and Hadith evidence, making Islamic law accessible and applicable to contemporary American Muslim life.",
      "age_tier": "adults",
      "subject": "fiqh",
      "difficulty": "beginner",
      "duration_weeks": 18,
      "schedule": "2 lessons per week, 25-30 minutes each",
      "instructor": "Ustadh Ibrahim Al-Amali",
      "is_featured": true,
      "prerequisites": null,
      "learning_outcomes": [
        "Practical knowledge of daily Islamic rulings",
        "Understanding of purification and cleanliness in Islam",
        "Confidence in applying Islamic principles to modern situations",
        "Knowledge of halal and haram in food, business, and social life",
        "Ability to make informed decisions based on Islamic law",
        "Foundation for further fiqh studies"
      ],
      "publishedAt": "2025-01-15T00:00:00.000Z"
    },
    {
      "title": "Hadith Studies - The 40 Hadith of Imam An-Nawawi",
      "slug": "hadith-studies-40-nawawi",
      "description": "Study the foundational 40 Hadith collection by Imam An-Nawawi that encompasses the core principles of Islam. This 20-week intermediate course provides authentic Arabic text, English translation, detailed explanations, and practical applications for each hadith. Learn hadith sciences, authentication methodology, and how these timeless teachings guide Muslim life in America today.",
      "age_tier": "adults",
      "subject": "hadith",
      "difficulty": "intermediate",
      "duration_weeks": 20,
      "schedule": "2 hadiths per week, 30-35 minutes each",
      "instructor": "Sheikh Muhammad Al-Muhaddith",
      "is_featured": true,
      "prerequisites": "Basic understanding of Hadith terminology and Islamic principles",
      "learning_outcomes": [
        "Memorization and understanding of 40 foundational Hadiths",
        "Knowledge of Hadith sciences and authentication methodology",
        "Understanding of core Islamic principles through Prophetic teachings",
        "Ability to apply Hadith wisdom to contemporary situations",
        "Skills in Hadith analysis and interpretation",
        "Connection to the Sunnah of Prophet Muhammad ﷺ"
      ],
      "publishedAt": "2025-01-15T00:00:00.000Z"
    }
  ],
  "lessons": {
    "fiqh-of-worship-comprehensive-islamic-jurisprudence": [
      {
        "title": "Lesson 1: Introduction to Fiqh and Purification (Taharah) - Part 1",
        "slug": "lesson-1-introduction-fiqh-purification-part-1",
        "description": "Begin your journey into Islamic jurisprudence with an introduction to Fiqh as a science and the fundamental rulings of purification (Taharah). Learn about the types of water used for purification and the conditions of wudu.",
        "lesson_order": 1,
        "lesson_type": "reading",
        "duration_minutes": 35,
        "content": "<h1>Introduction to Fiqh and Purification (Taharah) - Part 1</h1>\n\n<h2>What is Fiqh?</h2>\n<p>Fiqh (Islamic jurisprudence) is the human understanding and application of the Shariah (Islamic law) derived from its sources: the Quran, Sunnah, Ijma (consensus), and Qiyas (analogical reasoning). While Shariah is divine and unchangeable, Fiqh represents scholarly efforts to understand and apply these divine laws to human situations.</p>\n\n<p><strong>Definition:</strong> Fiqh linguistically means \"understanding\" and technically refers to the knowledge of practical Islamic rulings derived from detailed evidence.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">فَلَوْلَا نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَائِفَةٌ لِّيَتَفَقَّهُوا فِي الدِّينِ</p>\n<p><em>\"Why does not a group from every section go forth to learn the religion deeply (liyatafaqqahu fi ad-deen)?\"</em> (Surah At-Tawbah 9:122)</p>\n</div>\n\n<h2>The Importance of Purification in Islam</h2>\n<p>Purification (Taharah) is the foundation of worship in Islam. Without purification, prayer - the pillar of Islam - cannot be valid. Allah emphasizes cleanliness repeatedly in the Quran.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ</p>\n<p><em>\"Truly, Allah loves those who turn to Him constantly and He loves those who keep themselves pure and clean.\"</em> (Surah Al-Baqarah 2:222)</p>\n</div>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated Abu Hurairah (RA):</strong> The Prophet ﷺ said: <em>\"Purification is half of faith.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>Types of Water for Purification</h2>\n\n<h3>1. Pure and Purifying Water (الماء الطهور)</h3>\n<p>This is water in its original state that can be used for purification and drinking. It includes:</p>\n<ul>\n<li>Rainwater</li>\n<li>Sea water</li>\n<li>River and spring water</li>\n<li>Well water</li>\n<li>Melted snow and ice</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated Abu Hurairah (RA):</strong> A man asked the Prophet ﷺ: \"O Messenger of Allah, we travel by sea and carry little water. If we use it for wudu, we will be thirsty. Can we perform wudu with sea water?\" The Prophet ﷺ replied: <em>\"Its water is pure (purifying) and its dead (animals) are lawful.\"</em> (Sunan Abu Dawud, Sahih)</p>\n</div>\n\n<h3>2. Pure but Not Purifying Water (الماء الطاهر غير المطهر)</h3>\n<p>This is water mixed with pure substances that changed its nature (color, smell, or taste), making it pure to drink but invalid for wudu. Examples include:</p>\n<ul>\n<li>Water mixed with soap or detergent</li>\n<li>Water cooked with food</li>\n<li>Water mixed with tea or coffee</li>\n</ul>\n\n<p><strong>Ruling:</strong> The majority of scholars hold that such water cannot be used for wudu or ghusl, though some Hanafi scholars permit it if the change is slight.</p>\n\n<h3>3. Impure Water (الماء النجس)</h3>\n<p>Water that has been contaminated by impurities (najasah) such as urine, blood, or feces. This water cannot be used for purification or consumption.</p>\n\n<p><strong>Exception:</strong> If the amount of water is large (approximately two qullas/200+ liters according to most scholars), it remains pure unless its color, taste, or smell changes due to the impurity.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated Abu Sa'id Al-Khudri (RA):</strong> The Prophet ﷺ said: <em>\"Water is pure (and remains pure) unless its taste, color, or smell changes due to impurity.\"</em> (Sunan Abi Dawud, Hassan)</p>\n</div>\n\n<h2>The Minor Ablution (Wudu) - Introduction</h2>\n<p>Wudu is the ritual washing prescribed for certain acts of worship, particularly the five daily prayers.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ</p>\n<p><em>\"O you who believe! When you intend to offer prayer, wash your faces and your hands up to the elbows, wipe your heads, and (wash) your feet up to the ankles.\"</em> (Surah Al-Ma'idah 5:6)</p>\n</div>\n\n<h3>Conditions for Valid Wudu</h3>\n<p>For wudu to be valid, certain conditions must be met:</p>\n<ol>\n<li><strong>Islam:</strong> The person must be Muslim</li>\n<li><strong>Sanity and Consciousness:</strong> The person must be of sound mind and conscious</li>\n<li><strong>Intention (Niyyah):</strong> The intention must be made in the heart</li>\n<li><strong>Pure Water:</strong> Water used must be pure and purifying</li>\n<li><strong>Removal of Barriers:</strong> Anything preventing water from reaching the skin must be removed (e.g., nail polish, thick creams)</li>\n<li><strong>Completion of Istinja:</strong> Cleansing after using the restroom must be completed first</li>\n<li><strong>No Wudu Nullifiers:</strong> The person must be in a state of purity when beginning</li>\n</ol>\n\n<h2>Practical Application for American Muslims</h2>\n<p><strong>Workplace Considerations:</strong> Many American Muslims face challenges performing wudu at work. Here are practical solutions:</p>\n<ul>\n<li>Use private restrooms or disability-accessible stalls for more space</li>\n<li>Consider wiping over socks (khuff) to simplify the process in public spaces</li>\n<li>For women wearing makeup: avoid waterproof products that create barriers</li>\n<li>Time wudu with restroom breaks to minimize workplace disruption</li>\n</ul>\n\n<p><strong>Water Quality:</strong> In America, tap water is generally safe and pure for wudu. If you live in an area with hard water or chlorine concerns, the water remains valid for purification despite its taste or odor, as these come from naturally occurring or safe additives.</p>\n\n<h2>Summary and Key Points</h2>\n<ul>\n<li>Fiqh is the human understanding of Islamic law derived from divine sources</li>\n<li>Purification is essential and beloved to Allah</li>\n<li>Water for wudu must be pure and in its natural state</li>\n<li>Wudu requires specific conditions to be valid</li>\n<li>American Muslims can adapt practices while maintaining Islamic validity</li>\n</ul>\n\n<h2>Next Lesson Preview</h2>\n<p>In the next lesson, we will cover the detailed steps of performing wudu, its obligatory and recommended acts, and what nullifies wudu.</p>",
        "video_url": null,
        "interactive_content": {
          "has_quran_references": true,
          "has_hadith_references": true,
          "practical_scenarios": true,
          "madhahib_differences": true
        },
        "learning_objectives": [
          "Define Fiqh and understand its relationship to Shariah",
          "Recognize the importance of purification in Islamic worship",
          "Identify the three types of water and their rulings",
          "List the conditions required for valid wudu",
          "Apply purification knowledge to American Muslim contexts",
          "Understand Quranic and Hadith evidence for purification",
          "Distinguish between pure, purifying, and impure water"
        ],
        "prerequisites": null,
        "is_free": true,
        "is_preview": true,
        "publishedAt": "2025-01-15T00:00:00.000Z"
      },
      {
        "title": "Lesson 2: Wudu - Obligatory Acts and Sunnahs",
        "slug": "lesson-2-wudu-obligatory-acts-sunnahs",
        "description": "Master the complete method of performing wudu with detailed explanation of obligatory acts (fard), recommended actions (sunnah), and what nullifies wudu. Learn the prophetic method with evidence.",
        "lesson_order": 2,
        "lesson_type": "reading",
        "duration_minutes": 38,
        "content": "<h1>Wudu - Obligatory Acts and Sunnahs</h1>\n\n<h2>The Obligatory Acts (Fard) of Wudu</h2>\n<p>These are the essential actions without which wudu is invalid. Scholars agree on four main obligatory acts derived from Surah Al-Ma'idah 5:6:</p>\n\n<h3>1. Washing the Face (غسل الوجه)</h3>\n<p>The face extends from the hairline to the chin vertically, and from ear to ear horizontally. This includes rinsing the mouth and nose.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>Allah says: <em>\"Wash your faces...\"</em> (Surah Al-Ma'idah 5:6)</p>\n<p><strong>Hadith:</strong> The Prophet ﷺ would rinse his mouth and nose during wudu. (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>2. Washing the Arms to the Elbows (غسل اليدين إلى المرفقين)</h3>\n<p>Wash both arms from the fingertips to and including the elbows.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>Allah says: <em>\"...and your hands (arms) up to the elbows...\"</em> (Surah Al-Ma'idah 5:6)</p>\n<p><strong>Hadith:</strong> Abu Hurairah (RA) narrated that the Prophet ﷺ washed his arms up to the elbows. (Sahih Muslim)</p>\n</div>\n\n<h3>3. Wiping the Head (مسح الرأس)</h3>\n<p>Wipe over the head with wet hands. The minimum is wiping any part of the head, but the Sunnah is to wipe the entire head once.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>Allah says: <em>\"...wipe over your heads...\"</em> (Surah Al-Ma'idah 5:6)</p>\n</div>\n\n<h3>4. Washing the Feet to the Ankles (غسل الرجلين إلى الكعبين)</h3>\n<p>Wash both feet including the ankles, ensuring water reaches between the toes.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>Allah says: <em>\"...and (wash) your feet to the ankles.\"</em> (Surah Al-Ma'idah 5:6)</p>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Woe to the heels from the Hellfire\"</em> (warning those who don't wash feet properly). (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>5. The Proper Order (الترتيب)</h3>\n<p>Performing the actions in the sequence prescribed in the Quran (face, arms, head, feet).</p>\n\n<h3>6. Continuity (الموالاة)</h3>\n<p>Performing the actions consecutively without long gaps between them. The majority of scholars consider this obligatory.</p>\n\n<h2>The Recommended Acts (Sunan) of Wudu</h2>\n<p>These actions are from the Sunnah of the Prophet ﷺ and earn extra reward but don't invalidate wudu if omitted.</p>\n\n<h3>1. Beginning with Bismillah</h3>\n<p>Say \"Bismillah\" (In the name of Allah) before starting wudu.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"There is no wudu for one who does not mention Allah's name over it.\"</em> (Sunan Abu Dawud, Hasan)</p>\n</div>\n\n<h3>2. Using the Siwak (Miswak)</h3>\n<p>Clean the teeth with siwak or a toothbrush before wudu.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"If it were not that it would be too difficult on my Ummah, I would have commanded them to use the siwak with every wudu.\"</em> (Sahih Bukhari)</p>\n</div>\n\n<h3>3. Washing the Hands Three Times</h3>\n<p>Wash both hands up to the wrists three times before starting the main acts of wudu.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> Uthman (RA) demonstrated the Prophet's wudu, beginning by washing his hands three times. (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>4. Thoroughness in Rinsing (المبالغة)</h3>\n<p>Rinse the mouth and nose thoroughly, except when fasting.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Exaggerate in rinsing the nose unless you are fasting.\"</em> (Sunan Abu Dawud, Sahih)</p>\n</div>\n\n<h3>5. Running Fingers Through the Beard</h3>\n<p>For men with thick beards, run wet fingers through the beard.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ would run his fingers through his beard during wudu. (Sunan At-Tirmidhi, Sahih)</p>\n</div>\n\n<h3>6. Washing Each Part Three Times</h3>\n<p>Wash each body part three times (face, arms, feet). The head is wiped once only.</p>\n\n<h3>7. Running Fingers Between Toes</h3>\n<p>Ensure water reaches between the toes by running fingers through them.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Perfect your wudu, run your fingers through your toes.\"</em> (Sunan At-Tirmidhi, Sahih)</p>\n</div>\n\n<h3>8. Wiping the Ears</h3>\n<p>Wipe the inside and outside of both ears with wet hands (new water is not required).</p>\n\n<h3>9. Beginning with the Right Side</h3>\n<p>Start with the right when washing arms and feet.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> Aisha (RA) said: <em>\"The Prophet ﷺ loved to start with the right side in all his affairs.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h2>The Complete Method of Wudu</h2>\n<ol>\n<li>Make the intention in your heart (not spoken aloud)</li>\n<li>Say \"Bismillah\"</li>\n<li>Wash both hands up to the wrists three times</li>\n<li>Rinse the mouth three times</li>\n<li>Rinse the nose three times (sniff water in and blow out)</li>\n<li>Wash the entire face three times (from hairline to chin, ear to ear)</li>\n<li>Wash the right arm from fingertips to elbow three times</li>\n<li>Wash the left arm from fingertips to elbow three times</li>\n<li>Wipe the entire head once with wet hands (front to back and back to front)</li>\n<li>Wipe the inside and outside of both ears once</li>\n<li>Wash the right foot to the ankle three times, including between the toes</li>\n<li>Wash the left foot to the ankle three times, including between the toes</li>\n<li>Say the dua after wudu</li>\n</ol>\n\n<h2>Dua After Wudu</h2>\n<p class=\"arabic\" dir=\"rtl\">أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ</p>\n<p><em>\"Ash-hadu an la ilaha illa Allah wahdahu la shareeka lah, wa ash-hadu anna Muhammadan 'abduhu wa rasooluh.\"</em></p>\n<p><strong>Translation:</strong> \"I bear witness that there is no deity worthy of worship except Allah alone, with no partner, and I bear witness that Muhammad is His slave and Messenger.\"</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Whoever performs wudu and perfects it, then says [this dua], the eight gates of Paradise will be opened for him to enter through whichever he wishes.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>What Nullifies Wudu (نواقض الوضوء)</h2>\n\n<h3>1. Anything Exiting from the Private Parts</h3>\n<p>This includes urine, feces, gas, or any other discharge.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Allah does not accept the prayer of one who has released gas until he performs wudu again.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>2. Deep Sleep</h3>\n<p>Sleep that causes loss of consciousness nullifies wudu. Light sleep while sitting firmly does not, according to the majority.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"The eye is the drawstring of the anus; whoever sleeps, let him perform wudu.\"</em> (Sunan Abu Dawud, Hasan)</p>\n</div>\n\n<h3>3. Loss of Consciousness</h3>\n<p>Fainting, insanity, or intoxication nullifies wudu.</p>\n\n<h3>4. Touching Private Parts Directly</h3>\n<p>Touching one's own or someone else's private parts directly (without barrier) nullifies wudu according to the majority of scholars.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Whoever touches his private part should perform wudu.\"</em> (Sunan An-Nasa'i, Sahih)</p>\n</div>\n\n<h3>5. Eating Camel Meat (according to some scholars)</h3>\n<p>The Hanbali school holds that eating camel meat nullifies wudu based on authentic hadith.</p>\n\n<h2>Doubts About Wudu</h2>\n<p><strong>Ruling:</strong> If you doubt whether you have wudu or not, assume you still have wudu if you were certain you had it before. If you're certain you didn't have wudu and doubt if you performed it, assume you don't have wudu.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"If one of you feels something in his stomach and doubts whether anything has come out, he should not leave the mosque unless he hears a sound or smells an odor.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>Practical Tips for American Muslims</h2>\n<ul>\n<li><strong>At Work:</strong> Perform wudu during regular restroom breaks; no need to announce why</li>\n<li><strong>Nail Polish:</strong> Must be removed before wudu as it prevents water from reaching nails</li>\n<li><strong>Makeup:</strong> Light makeup that doesn't form a barrier doesn't need removal; thick/waterproof must be removed</li>\n<li><strong>Socks:</strong> Learn about wiping over socks (covered in next lesson) for convenience</li>\n<li><strong>Jewelry:</strong> Rings should be moved to allow water underneath</li>\n</ul>\n\n<h2>Summary</h2>\n<ul>\n<li>Four obligatory acts: face, arms, head, feet - in order and consecutively</li>\n<li>Nine main recommended acts earn extra reward</li>\n<li>Wudu is nullified by specific actions, primarily those exiting the private parts</li>\n<li>When in doubt, follow the principle of certainty</li>\n</ul>",
        "video_url": null,
        "interactive_content": {
          "has_quran_references": true,
          "has_hadith_references": true,
          "practical_scenarios": true,
          "step_by_step_guide": true
        },
        "learning_objectives": [
          "Identify and perform the obligatory acts of wudu correctly",
          "Understand and apply the Sunnah acts of wudu",
          "Memorize the complete method of wudu with evidence",
          "Recognize what nullifies wudu and why",
          "Apply wudu rulings to everyday American Muslim life",
          "Handle doubts about wudu according to Islamic principles",
          "Learn the dua after wudu and its reward"
        ],
        "prerequisites": "Completion of Lesson 1 or basic understanding of purification",
        "is_free": true,
        "is_preview": false,
        "publishedAt": "2025-01-15T00:00:00.000Z"
      },
      {
        "title": "Lesson 3: Wiping Over Socks and Major Ablution (Ghusl)",
        "slug": "lesson-3-wiping-over-socks-major-ablution-ghusl",
        "description": "Learn the rulings of wiping over socks (khuff) and performing ghusl (major ablution). Understand when ghusl becomes obligatory and the correct method with authentic evidence.",
        "lesson_order": 3,
        "lesson_type": "reading",
        "duration_minutes": 40,
        "content": "<h1>Wiping Over Socks and Major Ablution (Ghusl)</h1>\n\n<h2>Part 1: Wiping Over Socks (المسح على الخفين والجوربين)</h2>\n\n<h3>Introduction</h3>\n<p>One of the facilitations in Islamic law is the permission to wipe over socks or shoes instead of washing the feet during wudu. This is particularly beneficial for Muslims in cold climates, at work, or in public spaces.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Al-Mughirah ibn Shu'bah (RA):</strong> \"I was with the Prophet ﷺ on a journey, and I bent down to take off his leather socks. He said: <em>'Leave them, for I put them on when I was in a state of purity,' and he wiped over them.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>Conditions for Wiping Over Socks</h3>\n<p>For wiping to be valid, the following conditions must be met:</p>\n\n<h4>1. Purity When Wearing</h4>\n<p>The socks must be put on while in a state of wudu (after washing the feet).</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>The Prophet ﷺ said to Al-Mughirah: <em>\"Leave them, for I put them on when I was in a state of purity.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h4>2. The Socks Must Be Pure</h4>\n<p>The socks themselves must be free from impurities (najasah).</p>\n\n<h4>3. The Socks Must Be Permissible to Wear</h4>\n<p>They should not be made from impermissible materials (e.g., gold thread for men, silk for men except for medical reasons).</p>\n\n<h4>4. The Socks Must Cover the Feet Properly</h4>\n<p>According to the majority, the socks should cover the ankles. The Hanafi school has stricter conditions, but the more lenient opinion is that any sock that stays on the foot during normal walking is acceptable.</p>\n\n<h4>5. Time Limit</h4>\n<ul>\n<li><strong>Resident (Muqim):</strong> 24 hours (one day and night)</li>\n<li><strong>Traveler (Musafir):</strong> 72 hours (three days and nights)</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Narrated by Ali (RA):</strong> \"The Prophet ﷺ set the time limit for wiping as three days and nights for the traveler, and one day and night for the resident.\" (Sahih Muslim)</p>\n</div>\n\n<h3>How to Wipe Over Socks</h3>\n<ol>\n<li>After performing the beginning parts of wudu (washing hands, rinsing mouth and nose, washing face and arms, wiping head)</li>\n<li>Instead of washing the feet, wipe the top of each sock once with wet hands</li>\n<li>Wipe from the toes toward the shin</li>\n<li>It is not necessary to wipe the bottom or sides of the socks</li>\n</ol>\n\n<h3>What Invalidates Wiping</h3>\n<ul>\n<li>Anything that invalidates wudu (you wipe again in the next wudu)</li>\n<li>Expiration of the time limit (must remove socks and wash feet)</li>\n<li>Removing the socks (must wash feet)</li>\n<li>Anything that requires ghusl (must remove and perform ghusl)</li>\n</ul>\n\n<h3>Modern Application</h3>\n<p><strong>Can you wipe over regular socks?</strong> Yes, according to the majority of contemporary scholars. The early scholars' conditions about thickness were based on the leather socks of their time. Modern socks that cover the ankles and stay on during walking fulfill the purpose.</p>\n\n<p><strong>Can you wipe over shoes?</strong> Yes, if they cover the area that must be washed in wudu and are worn in a state of purity.</p>\n\n<p><strong>Practical Tip for Work:</strong> Before leaving for work with wudu, put on your socks. You can then wipe over them throughout the day, making wudu at work much easier and more practical.</p>\n\n<h2>Part 2: Major Ablution (الغسل - Ghusl)</h2>\n\n<h3>Definition and Importance</h3>\n<p>Ghusl is the ritual bathing that purifies the entire body. It is required in specific situations and is a means of attaining complete spiritual and physical purity.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">وَإِن كُنتُمْ جُنُبًا فَاطَّهَّرُوا</p>\n<p><em>\"And if you are in a state of janabah (major impurity), then purify yourselves (by bathing).\"</em> (Surah Al-Ma'idah 5:6)</p>\n</div>\n\n<h3>When Ghusl Becomes Obligatory</h3>\n\n<h4>1. After Sexual Intercourse</h4>\n<p>Ghusl is obligatory after sexual intercourse, even if there was no ejaculation.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Abu Hurairah (RA):</strong> The Prophet ﷺ said: <em>\"When anyone sits between the four parts (arms and legs of his wife) and exerts himself, then ghusl becomes obligatory.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h4>2. After Ejaculation (with desire)</h4>\n<p>Whether due to sexual activity or a wet dream, ejaculation with sexual pleasure requires ghusl.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Umm Sulaim (RA):</strong> She asked the Prophet ﷺ about a woman who sees in her dream what a man sees (has a wet dream). He ﷺ said: <em>\"If she sees water (discharge), then she must perform ghusl.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h4>3. After Menstruation (Hayd)</h4>\n<p>Women must perform ghusl after their menstrual period ends.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ ۖ قُلْ هُوَ أَذًى فَاعْتَزِلُوا النِّسَاءَ فِي الْمَحِيضِ ۖ وَلَا تَقْرَبُوهُنَّ حَتَّىٰ يَطْهُرْنَ ۖ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ</p>\n<p><em>\"They ask you about menstruation. Say: It is harm, so keep away from women during menstruation and do not approach them until they are pure. When they have purified themselves, then come to them from where Allah has ordained for you.\"</em> (Surah Al-Baqarah 2:222)</p>\n</div>\n\n<h4>4. After Postpartum Bleeding (Nifas)</h4>\n<p>Women must perform ghusl after postpartum bleeding stops.</p>\n\n<h4>5. After Death (for the deceased)</h4>\n<p>The deceased Muslim must be given ghusl before burial (this is a communal obligation).</p>\n\n<h3>When Ghusl is Recommended (Mustahabb)</h3>\n<ul>\n<li>Before Friday prayer</li>\n<li>Before the two Eid prayers</li>\n<li>Before entering ihram for Hajj or Umrah</li>\n<li>After washing a deceased person</li>\n<li>Upon accepting Islam</li>\n</ul>\n\n<h3>The Obligatory Acts of Ghusl</h3>\n<p>According to the majority of scholars, ghusl has only one obligatory act:</p>\n\n<p><strong>Washing the Entire Body Once</strong> - Including rinsing the mouth and nose, and ensuring water reaches every part of the body including the hair roots.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p>Allah says: <em>\"...then purify yourselves.\"</em> (Surah Al-Ma'idah 5:6) - meaning wash your entire body.</p>\n</div>\n\n<h3>The Complete (Sunnah) Method of Ghusl</h3>\n<p>This is how the Prophet ﷺ would perform ghusl:</p>\n\n<ol>\n<li><strong>Make the intention</strong> in your heart to purify yourself from major impurity</li>\n<li><strong>Say \"Bismillah\"</strong></li>\n<li><strong>Wash the hands three times</strong></li>\n<li><strong>Wash the private parts</strong> and any impurities on the body</li>\n<li><strong>Perform complete wudu</strong> as you would for prayer (you may delay washing the feet until the end)</li>\n<li><strong>Pour water over the head three times</strong>, ensuring it reaches the roots of the hair</li>\n<li><strong>Pour water over the entire body</strong>, starting with the right side, then the left</li>\n<li><strong>Wash the feet</strong> (if you delayed this from wudu)</li>\n</ol>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Aisha (RA):</strong> \"When the Prophet ﷺ performed ghusl for janabah, he would wash his hands, perform wudu as for prayer, then pour water over his head three times, then pour water over the rest of his body.\" (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>Important Points About Ghusl</h3>\n\n<h4>For Women:</h4>\n<ul>\n<li><strong>Braided Hair:</strong> Women don't need to undo braids for ghusl from menstruation or postpartum bleeding if water reaches the scalp</li>\n<li><strong>Ghusl from Janabah:</strong> Some scholars say braids should be undone; others say it's sufficient if water reaches the roots</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Narrated by Umm Salamah (RA):</strong> She asked: \"O Messenger of Allah, I am a woman with braided hair; should I undo it for ghusl from janabah?\" He ﷺ said: <em>\"No, it is enough for you to pour three handfuls of water over your head, then pour water over yourself and you will be purified.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h4>Barriers to Water:</h4>\n<ul>\n<li>Nail polish must be removed (prevents water from reaching nails)</li>\n<li>Thick waterproof makeup must be removed</li>\n<li>Anything preventing water from reaching the skin must be removed</li>\n</ul>\n\n<h4>Shower vs. Bath:</h4>\n<p>Both are acceptable. The key is ensuring water reaches every part of the body. A shower is generally easier and follows the Sunnah method more closely.</p>\n\n<h3>Common Questions</h3>\n\n<p><strong>Q: Does ghusl replace wudu?</strong></p>\n<p>A: Yes, if you make the intention for ghusl and wudu together, or if you perform complete wudu during ghusl, you don't need separate wudu for prayer.</p>\n\n<p><strong>Q: Can you pray with only ghusl and without wudu?</strong></p>\n<p>A: According to the majority, ghusl includes wudu if done properly (washing mouth, nose, face, arms, head, feet). The Hanafi school requires separate wudu to be certain.</p>\n\n<p><strong>Q: What if you're not sure if you reached every part?</strong></p>\n<p>A: If you made a reasonable effort and are uncertain, assume you did reach everywhere. If you're certain you missed a spot, wash that area.</p>\n\n<h2>Practical Application for American Muslims</h2>\n\n<p><strong>Time Management:</strong> Ghusl takes 5-10 minutes when done properly. Plan accordingly before Fajr prayer or Friday Jumu'ah.</p>\n\n<p><strong>Water Conservation:</strong> Islam emphasizes not wasting water. The Prophet ﷺ would perform ghusl with approximately 2-3 liters of water. Be thorough but don't be excessive.</p>\n\n<p><strong>Privacy:</strong> Ghusl requires privacy. Ensure bathroom doors are locked and you have adequate time without interruption.</p>\n\n<h2>Summary</h2>\n<ul>\n<li>Wiping over socks is a facilitation in Islam with specific conditions</li>\n<li>Ghusl is obligatory after sexual activity, ejaculation, menstruation, and postpartum bleeding</li>\n<li>The minimum ghusl is washing the entire body once with the intention</li>\n<li>The complete Sunnah method includes wudu and is more rewarding</li>\n<li>Both men and women have specific considerations for ghusl</li>\n</ul>",
        "video_url": null,
        "interactive_content": {
          "has_quran_references": true,
          "has_hadith_references": true,
          "practical_scenarios": true,
          "madhahib_differences": true
        },
        "learning_objectives": [
          "Understand the conditions for wiping over socks",
          "Apply the rulings of wiping in daily life for convenience",
          "Identify when ghusl becomes obligatory",
          "Perform ghusl correctly according to the Sunnah method",
          "Distinguish between obligatory and recommended acts of ghusl",
          "Address gender-specific considerations for ghusl",
          "Apply water conservation principles while maintaining validity"
        ],
        "prerequisites": "Completion of Lessons 1-2 or understanding of wudu",
        "is_free": true,
        "is_preview": false,
        "publishedAt": "2025-01-15T00:00:00.000Z"
      }
    ],
    "practical-fiqh-for-daily-life": [
      {
        "title": "Lesson 1: Cleanliness and Personal Hygiene in Islam",
        "slug": "lesson-1-cleanliness-personal-hygiene-islam",
        "description": "Learn the Islamic perspective on cleanliness, personal hygiene, and the fitrah (natural disposition). Understand the prophetic guidance on maintaining cleanliness in daily life.",
        "lesson_order": 1,
        "lesson_type": "reading",
        "duration_minutes": 28,
        "content": "<h1>Cleanliness and Personal Hygiene in Islam</h1>\n\n<h2>Introduction: Cleanliness in Islamic Perspective</h2>\n<p>Islam is a comprehensive way of life that emphasizes both spiritual and physical cleanliness. Personal hygiene is not just encouraged but is considered part of faith (iman).</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Abu Malik Al-Ash'ari (RA):</strong> The Prophet ﷺ said: <em>\"Cleanliness is half of faith (iman).\"</em> (Sahih Muslim)</p>\n</div>\n\n<p>This hadith establishes that physical cleanliness is integral to our faith, not separate from it. A Muslim should be recognized by their cleanliness, pleasant appearance, and good hygiene.</p>\n\n<h2>The Fitrah - Natural Disposition</h2>\n<p>The Fitrah refers to the natural way humans are created, inclined toward cleanliness and beauty. The Prophet ﷺ outlined specific acts that are part of human nature.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Abu Hurairah (RA):</strong> The Prophet ﷺ said: <em>\"Five things are part of the fitrah: circumcision, shaving the pubic hair, trimming the mustache, cutting the nails, and plucking the armpit hair.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<p>Another narration adds additional acts:</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Hadith</h3>\n<p><strong>Narrated by Aisha (RA):</strong> The Prophet ﷺ said: <em>\"Ten things are from the fitrah: trimming the mustache, growing the beard, using the siwak (tooth stick), rinsing the nose with water, cutting the nails, washing the finger joints, plucking armpit hair, shaving the pubic hair, washing the private parts with water, and rinsing the mouth.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>Personal Hygiene Practices in Detail</h2>\n\n<h3>1. Using the Siwak (Miswak) - Tooth Cleaning</h3>\n<p>The siwak is a teeth-cleaning twig from the Arak tree. Using it is a strongly recommended Sunnah.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"If it were not that it would be too difficult for my Ummah, I would have commanded them to use the siwak with every prayer.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<p><strong>Benefits mentioned by the Prophet ﷺ:</strong></p>\n<ul>\n<li>Purifies the mouth</li>\n<li>Pleases the Lord</li>\n<li>Cleans the teeth</li>\n<li>Strengthens the gums</li>\n</ul>\n\n<p><strong>Modern Application:</strong> Toothbrush and toothpaste serve the same purpose. Brush at least twice daily, and before each prayer if possible. The siwak can be used throughout the day as a supplement.</p>\n\n<h3>2. Trimming the Mustache and Growing the Beard (for Men)</h3>\n<p>For men, Islamic guidance encourages keeping the mustache trimmed and allowing the beard to grow.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Trim the mustache and let the beard grow; be different from the polytheists.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<p><strong>Scholarly Opinion:</strong> There is difference of opinion regarding the ruling:</p>\n<ul>\n<li><strong>Obligatory (Wajib):</strong> Hanbali school and many contemporary scholars</li>\n<li><strong>Strongly Recommended (Sunnah Mu'akkadah):</strong> Some Shafi'i scholars</li>\n<li><strong>Consensus:</strong> All agree it should not be shaved completely</li>\n</ul>\n\n<p><strong>American Context:</strong> Muslim men should maintain their beard in a neat, professional manner that doesn't hinder employment or safety (e.g., certain medical or safety-sensitive jobs may require accommodation).</p>\n\n<h3>3. Cutting the Nails</h3>\n<p>Keeping nails trimmed is part of cleanliness and the fitrah.</p>\n\n<p><strong>Recommendation:</strong> Nails should not be left to grow excessively. Scholars recommend trimming them at least every 40 days, but more frequent trimming is better.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> Anas ibn Malik (RA) said: <em>\"The Prophet ﷺ set a time limit for us regarding trimming the mustache, cutting the nails, plucking armpit hair, and shaving the pubic hair: they should not be left for more than forty days.\"</em> (Sahih Muslim)</p>\n</div>\n\n<p><strong>Etiquette:</strong></p>\n<ul>\n<li>Start with the right hand, then the left</li>\n<li>Dispose of nail clippings properly (burying them is recommended by some scholars)</li>\n<li>Friday before Jumu'ah prayer is an excellent time to trim nails</li>\n</ul>\n\n<h3>4. Removing Pubic and Armpit Hair</h3>\n<p>Removing hair from the private areas and armpits is part of the fitrah and Islamic cleanliness.</p>\n\n<p><strong>Time Limit:</strong> Should be done at least every 40 days (as mentioned in the previous hadith).</p>\n\n<p><strong>Methods:</strong> Shaving, hair removal creams, or other safe methods are all permissible. Choose what is safe and effective.</p>\n\n<p><strong>For Women:</strong> This is also required but with greater emphasis on privacy and the impermissibility of revealing one's private areas to others (except spouse or same-gender medical professionals when necessary).</p>\n\n<h3>5. Circumcision (for Males)</h3>\n<p>Male circumcision is an established practice in Islam and is considered obligatory by the majority of scholars.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"The fitrah consists of five things: circumcision...\"</em> (as mentioned earlier)</p>\n</div>\n\n<p><strong>Medical Benefits:</strong> Modern medical research confirms numerous health benefits of circumcision, including reduced risk of infections and certain diseases.</p>\n\n<p><strong>For American Muslims:</strong> Circumcision is widely practiced in American hospitals and is generally covered by health insurance when done in infancy.</p>\n\n<h3>6. Istinja and Istijmar - Cleaning After Using the Restroom</h3>\n<p>Islam mandates thorough cleansing after using the restroom.</p>\n\n<p><strong>Istijmar:</strong> Cleaning with dry material (stones, tissue paper, etc.)</p>\n<p><strong>Istinja:</strong> Cleaning with water</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"When any of you goes to relieve himself, let him take with him three stones with which to clean himself, and that will be sufficient for him.\"</em> (Sunan Abu Dawud, Sahih)</p>\n</div>\n\n<p><strong>Ruling:</strong> Either water alone or dry material followed by water is acceptable. Using water is superior and most thorough.</p>\n\n<p><strong>Modern Practice:</strong></p>\n<ul>\n<li>Use toilet paper followed by water (portable bidet, lota/istinja bottle)</li>\n<li>Many American Muslim homes install bidet attachments to toilets</li>\n<li>Portable water bottles can be kept in restrooms at work</li>\n<li>Always clean with the left hand (keeping the right hand clean for eating and other purposes)</li>\n</ul>\n\n<h3>7. Etiquette of Using the Restroom</h3>\n\n<p><strong>When Entering:</strong></p>\n<ul>\n<li>Enter with the left foot first</li>\n<li>Say: \"Bismillah, Allahumma inni a'udhu bika minal khubthi wal khaba'ith\" (In the name of Allah, O Allah I seek refuge in You from male and female evil spirits)</li>\n</ul>\n\n<p><strong>While Inside:</strong></p>\n<ul>\n<li>Do not talk unnecessarily</li>\n<li>Do not take anything with Allah's name on it (like Quran, or items with Quranic verses)</li>\n<li>Do not face or turn your back to the Qiblah when possible (less emphasis in enclosed bathrooms)</li>\n</ul>\n\n<p><strong>When Exiting:</strong></p>\n<ul>\n<li>Exit with the right foot first</li>\n<li>Say: \"Ghufranak\" (I seek Your forgiveness)</li>\n<li>Wash hands thoroughly with soap</li>\n</ul>\n\n<h2>Cleanliness of Clothing</h2>\n\n<div class=\"evidence-box\">\n<h3>Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">وَثِيَابَكَ فَطَهِّرْ</p>\n<p><em>\"And purify your garments.\"</em> (Surah Al-Muddaththir 74:4)</p>\n</div>\n\n<p><strong>Guidelines:</strong></p>\n<ul>\n<li>Clothes must be free from impurities (najasah) for prayer</li>\n<li>Clothes should be clean and presentable, especially for Friday prayer and gatherings</li>\n<li>Islamic modesty should be observed in clothing choices</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Allah is beautiful and loves beauty.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>Personal Fragrance and Appearance</h2>\n\n<p>Islam encourages Muslims to smell good and present themselves well, especially when going to the mosque or gathering with people.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Whoever eats garlic or onion should stay away from us (or from our mosque) and stay in his house.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<p>This shows concern for not offending others with bad odors.</p>\n\n<p><strong>For Men:</strong> Using non-alcoholic perfumes and colognes is recommended, especially before Friday and Eid prayers.</p>\n\n<p><strong>For Women:</strong> Using fragrance at home is recommended, but women should not wear strong perfume when going out where non-mahram men can smell it.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Any woman who puts on perfume and passes by people so that they can smell her fragrance is a adulteress.\"</em> (Sunan Abu Dawud, Sahih)</p>\n<p><em>Note: This is a severe warning to emphasize the seriousness, not literal adultery, but refers to the sin of attracting non-mahram men.</em></p>\n</div>\n\n<h2>Practical Tips for American Muslims</h2>\n\n<h3>At Work:</h3>\n<ul>\n<li>Keep a small hygiene kit: siwak/toothbrush, fragrance, comb</li>\n<li>Refresh wudu and cleanliness before each prayer</li>\n<li>Be conscious of personal space and hygiene in professional settings</li>\n</ul>\n\n<h3>At Home:</h3>\n<ul>\n<li>Install bidet attachments for easier istinja</li>\n<li>Keep siwak accessible throughout the house</li>\n<li>Maintain Friday grooming routine (shower, trim nails, wear clean clothes, use fragrance)</li>\n</ul>\n\n<h3>Social Settings:</h3>\n<ul>\n<li>Always maintain pleasant breath (avoid smoking, strong-smelling foods before social gatherings)</li>\n<li>Present yourself cleanly and modestly</li>\n<li>Set a positive example as a Muslim in cleanliness and presentation</li>\n</ul>\n\n<h2>Summary and Key Points</h2>\n<ul>\n<li>Cleanliness is half of faith - it's integral to being a good Muslim</li>\n<li>The fitrah includes specific acts of personal hygiene</li>\n<li>Regular maintenance of personal hygiene should be done at least every 40 days</li>\n<li>Istinja (cleaning with water) is essential after using the restroom</li>\n<li>Muslims should be known for their pleasant appearance, cleanliness, and good smell</li>\n<li>Modern tools (toothbrush, bidet) can fulfill the same objectives as traditional methods</li>\n</ul>\n\n<p><strong>Remember:</strong> Personal hygiene in Islam is worship. Every act of cleanliness, when done with the intention of following the Sunnah and pleasing Allah, earns reward.</p>",
        "video_url": null,
        "interactive_content": {
          "has_quran_references": true,
          "has_hadith_references": true,
          "practical_scenarios": true,
          "american_muslim_context": true
        },
        "learning_objectives": [
          "Understand the Islamic perspective on cleanliness as half of faith",
          "Identify the acts of fitrah and their importance",
          "Apply proper hygiene practices in daily life",
          "Learn the etiquette of using the restroom in Islam",
          "Understand the rulings on personal grooming for men and women",
          "Implement practical hygiene habits in American contexts",
          "Recognize the spiritual dimension of physical cleanliness"
        ],
        "prerequisites": null,
        "is_free": true,
        "is_preview": true,
        "publishedAt": "2025-01-15T00:00:00.000Z"
      }
    ],
    "hadith-studies-40-nawawi": [
      {
        "title": "Lesson 1: Hadith 1 - The Criterion of Deeds (Actions by Intentions)",
        "slug": "lesson-1-hadith-1-criterion-of-deeds",
        "description": "Study the first and most important hadith in Imam An-Nawawi's collection: \"Actions are by intentions.\" Understand the role of intention in every deed and how it transforms ordinary actions into worship.",
        "lesson_order": 1,
        "lesson_type": "reading",
        "duration_minutes": 35,
        "content": "<h1>Hadith 1: The Criterion of Deeds - Actions are by Intentions</h1>\n\n<h2>Introduction to the 40 Hadith Collection</h2>\n<p>Imam Yahya ibn Sharaf An-Nawawi (631-676 AH / 1233-1277 CE) was one of the greatest scholars of Islam. His compilation of 40 Hadiths (actually 42) encompasses the core principles of Islamic teachings. Scholars have said that the entire religion revolves around this hadith.</p>\n\n<h2>The Arabic Text</h2>\n<div class=\"arabic-text\" dir=\"rtl\">\n<p style=\"font-size: 1.6em; font-family: 'Amiri', serif; line-height: 2.2;\">\nعَنْ أَمِيرِ المُؤْمِنِينَ أَبِي حَفْصٍ عُمَرَ بْنِ الخَطَّابِ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْتُ رَسُولَ اللهِ صلى الله عليه وسلم يَقُولُ: \"إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ فَهِجْرَتُهُ إِلَى اللهِ وَرَسُولِهِ، وَمَنْ كَانَتْ هِجْرَتُهُ لِدُنْيَا يُصِيبُهَا أَوْ امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ\"\n</p>\n</div>\n\n<h2>English Translation</h2>\n<p><strong>On the authority of Umar ibn Al-Khattab (may Allah be pleased with him), who said:</strong></p>\n<p class=\"translation\" style=\"font-style: italic; font-size: 1.15em; padding: 15px; background: #f9f9f9; border-left: 4px solid #2d5c43;\">\n\"I heard the Messenger of Allah ﷺ say: <em>'Actions are judged by intentions, and every person will be rewarded according to what they intended. So whoever emigrated for the sake of Allah and His Messenger, then his emigration was for Allah and His Messenger. And whoever emigrated to gain some worldly benefit or to marry a woman, then his emigration was for that which he emigrated for.'\"</em>\n</p>\n\n<h2>Authentication</h2>\n<p><strong>Source:</strong> Sahih Al-Bukhari (1) and Sahih Muslim (1907)</p>\n<p><strong>Grade:</strong> Mutawatir (reported through so many chains that it is impossible to be false)</p>\n<p><strong>Narrator:</strong> Umar ibn Al-Khattab (RA), the second Caliph of Islam, known for his justice, wisdom, and close companionship with the Prophet ﷺ</p>\n\n<h2>Key Vocabulary and Terminology</h2>\n<ul>\n<li><strong>إِنَّمَا (Innama):</strong> \"Indeed\" or \"Verily\" - a particle of restriction/limitation indicating exclusivity</li>\n<li><strong>الأَعْمَالُ (Al-A'mal):</strong> Actions, deeds, works</li>\n<li><strong>النِّيَّات (An-Niyyat):</strong> Intentions (plural of niyyah)</li>\n<li><strong>هِجْرَة (Hijrah):</strong> Emigration - specifically the migration from Mecca to Medina, but generally means leaving something for Allah's sake</li>\n<li><strong>امْرِئ (Imri'):</strong> A person, an individual</li>\n</ul>\n\n<h2>Detailed Explanation and Commentary</h2>\n\n<h3>Part 1: \"Actions are judged by intentions\"</h3>\n<p>This opening statement is comprehensive and revolutionary. It establishes that:</p>\n\n<ol>\n<li><strong>The validity of an action depends on intention:</strong> An action may appear good outwardly but be worthless or even sinful if the intention is corrupt.</li>\n<li><strong>The reward for an action depends on intention:</strong> Two people may do the same action, but one receives immense reward while the other receives nothing, based solely on their intentions.</li>\n<li><strong>Intentions make ordinary actions into worship:</strong> Eating, sleeping, and working can all be acts of worship with the right intention.</li>\n</ol>\n\n<div class=\"evidence-box\">\n<h3>Supporting Evidence from Quran</h3>\n<p class=\"arabic\" dir=\"rtl\">وَمَا أُمِرُوا إِلَّا لِيَعْبُدُوا اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ</p>\n<p><em>\"And they were not commanded except to worship Allah, being sincere to Him in religion.\"</em> (Surah Al-Bayyinah 98:5)</p>\n</div>\n\n<h3>Part 2: \"Every person will be rewarded according to what they intended\"</h3>\n<p>This confirms that:</p>\n<ul>\n<li>Each person is responsible for their own intention</li>\n<li>The same outward action can earn different rewards for different people</li>\n<li>Allah judges what is in the heart, not just what is apparent</li>\n<li>Good intentions for good actions bring reward; bad intentions for outwardly good actions bring nothing or harm</li>\n</ul>\n\n<h3>Part 3: The Example of Hijrah</h3>\n<p>The Prophet ﷺ gave a practical example to clarify the concept. During his time, people emigrated from Mecca to Medina for various reasons:</p>\n\n<p><strong>Scenario 1 - Pure Intention:</strong> \"Whoever emigrated for the sake of Allah and His Messenger, then his emigration was for Allah and His Messenger.\"</p>\n<ul>\n<li>Such a person left everything behind for the sake of Allah and His religion</li>\n<li>They receive full reward for hijrah (one of the greatest acts of sacrifice in Islam)</li>\n<li>Their difficulty, loss of wealth, and separation from family are all counted as worship</li>\n</ul>\n\n<p><strong>Scenario 2 - Worldly Intention:</strong> \"Whoever emigrated to gain some worldly benefit or to marry a woman, then his emigration was for that which he emigrated for.\"</p>\n<ul>\n<li>The physical action (traveling from Mecca to Medina) was the same</li>\n<li>But because the intention was worldly gain or marriage, they receive no reward for hijrah</li>\n<li>They get what they intended: worldly benefit or marriage, but no spiritual reward</li>\n</ul>\n\n<p><strong>Note:</strong> There is a famous story about a man called \"Muhajir Umm Qais\" (the one who emigrated for Umm Qais) who emigrated to Medina to marry a woman named Umm Qais. This is mentioned as an example of corrupted intention.</p>\n\n<h2>Scholarly Insights</h2>\n\n<h3>Imam Ahmad ibn Hanbal said:</h3>\n<p>\"Islam is founded upon three Hadiths:</p>\n<ol>\n<li>The hadith of Umar: 'Actions are by intentions'</li>\n<li>The hadith of Aisha: 'Whoever innovates in this matter of ours that which is not from it will have it rejected'</li>\n<li>The hadith of Nu'man ibn Bashir: 'The halal is clear and the haram is clear'\"</li>\n</ol>\n\n<h3>Imam Ash-Shafi'i said:</h3>\n<p>\"This hadith comprises one-third of Islamic knowledge, and it enters into seventy chapters of fiqh (jurisprudence).\"</p>\n\n<h3>Imam An-Nawawi explained:</h3>\n<p>\"This hadith is one of the most important foundations of Islam. All rulings are based on it. That is why scholars have said this hadith is half of knowledge, because the servant's deeds are based on his heart (intention) and his limbs (action).\"</p>\n\n<h2>Types of Intentions</h2>\n\n<h3>1. Distinguishing Intention (نية التمييز)</h3>\n<p>This differentiates between types of worship and between worship and habit. For example:</p>\n<ul>\n<li>Intending Zuhr prayer (not Asr or a voluntary prayer)</li>\n<li>Intending obligatory fast (not voluntary fast)</li>\n<li>Intending worship when performing ablution (not just washing for cleanliness)</li>\n</ul>\n\n<h3>2. Purifying Intention (نية الإخلاص)</h3>\n<p>This means doing the action purely for Allah's sake, not for showing off, praise, or worldly gain. This is what earns reward.</p>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Verily, Allah does not look at your bodies or your appearances, but He looks at your hearts and your deeds.\"</em> (Sahih Muslim)</p>\n</div>\n\n<h2>Practical Applications for Modern Life</h2>\n\n<h3>1. Work and Career</h3>\n<p><strong>Scenario:</strong> You work a regular job.</p>\n<ul>\n<li><strong>Without proper intention:</strong> Your work is just to earn money (permissible but not worship)</li>\n<li><strong>With proper intention:</strong> \n  <ul>\n    <li>Working to provide for your family (a form of jihad and charity)</li>\n    <li>Working to be self-sufficient and not burden others</li>\n    <li>Working to earn halal income and avoid haram</li>\n    <li>Working to contribute positively to society</li>\n  </ul>\n  Now your 8-hour workday becomes 8 hours of worship!</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"The one who strives to help the widow and the poor is like the one who fights in the way of Allah or the one who stands in prayer at night and fasts during the day.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h3>2. Education and Learning</h3>\n<p><strong>Scenario:</strong> You're studying for a degree or certification.</p>\n<ul>\n<li><strong>Without proper intention:</strong> Studying only to get a degree, high salary, or status</li>\n<li><strong>With proper intention:</strong>\n  <ul>\n    <li>Seeking beneficial knowledge to serve humanity</li>\n    <li>Learning to better understand Allah's creation</li>\n    <li>Developing skills to contribute to the Muslim community</li>\n    <li>Fulfilling your responsibility to seek knowledge</li>\n  </ul>\n  Now studying becomes an act of worship!</li>\n</ul>\n\n<h3>3. Social Media and Communication</h3>\n<p><strong>Scenario:</strong> Posting on social media.</p>\n<ul>\n<li><strong>Without proper intention:</strong> Posting to show off, gain followers, or seek praise</li>\n<li><strong>With proper intention:</strong>\n  <ul>\n    <li>Sharing beneficial knowledge</li>\n    <li>Encouraging good and discouraging evil</li>\n    <li>Strengthening ties with family and friends</li>\n    <li>Inspiring others with positive content</li>\n  </ul>\n  Now your posts can earn reward!</li>\n</ul>\n\n<h3>4. Marriage and Family</h3>\n<p><strong>Scenario:</strong> Getting married.</p>\n<ul>\n<li><strong>Without proper intention:</strong> Marrying only for beauty, wealth, or status</li>\n<li><strong>With proper intention:</strong>\n  <ul>\n    <li>Completing half your faith</li>\n    <li>Protecting yourself from sin</li>\n    <li>Establishing a Muslim family</li>\n    <li>Finding companionship in obeying Allah</li>\n    <li>Having righteous children who will benefit the Ummah</li>\n  </ul>\n  Now marriage becomes worship from start to finish!</li>\n</ul>\n\n<h3>5. Acts of Charity</h3>\n<p><strong>Scenario:</strong> Giving money to the poor.</p>\n<ul>\n<li><strong>Corrupted intention:</strong> Giving to be seen as generous or to gain social status - no reward</li>\n<li><strong>Mixed intention:</strong> Wanting to help but also wanting recognition - reward is diminished</li>\n<li><strong>Pure intention:</strong> Giving secretly, seeking only Allah's pleasure - maximum reward</li>\n</ul>\n\n<div class=\"evidence-box\">\n<h3>Evidence</h3>\n<p><strong>Hadith:</strong> The Prophet ﷺ said: <em>\"Seven whom Allah will shade on the Day when there is no shade but His...\" - among them - \"A man who gives charity and conceals it so that his left hand does not know what his right hand gave.\"</em> (Sahih Bukhari and Muslim)</p>\n</div>\n\n<h2>Dangers of Corrupt Intentions</h2>\n\n<h3>1. Riya' (Showing Off)</h3>\n<p>Doing good deeds to be seen and praised by people.</p>\n\n<div class=\"evidence-box\">\n<h3>Warning from Hadith</h3>\n<p><strong>Hadith Qudsi:</strong> Allah says: <em>\"I am the One Who is most free from need of partners. Whoever does an action for the sake of someone else as well as Me, I discard him and his shirk (association).\"</em> (Sahih Muslim)</p>\n</div>\n\n<h3>2. Sum'ah (Doing for Fame)</h3>\n<p>Doing actions so people will speak well of you or know about your deeds.</p>\n\n<h3>3. Worldly Intentions for Religious Acts</h3>\n<p>Seeking knowledge only for status, performing Hajj for social prestige, or giving charity for tax benefits - these nullify or greatly diminish reward.</p>\n\n<h2>How to Purify Your Intention</h2>\n<ol>\n<li><strong>Learn about intention:</strong> Study what Allah loves and why He loves it</li>\n<li><strong>Make dua before actions:</strong> Ask Allah to purify your heart and intention</li>\n<li><strong>Conceal good deeds when possible:</strong> Do good secretly to avoid pride and showing off</li>\n<li><strong>Reflect regularly:</strong> Ask yourself \"Why am I doing this?\" throughout the day</li>\n<li><strong>Remember death and meeting Allah:</strong> This helps focus on the Hereafter rather than this world</li>\n<li><strong>Seek forgiveness:</strong> If you realize your intention was corrupted, repent and seek Allah's forgiveness</li>\n</ol>\n\n<h2>Questions for Self-Reflection</h2>\n<ul>\n<li>When I wake up for Fajr, is it out of love for Allah or just habit?</li>\n<li>When I give charity, do I hope people will find out?</li>\n<li>When I study or work, what is my ultimate goal?</li>\n<li>Am I attending Islamic classes to learn or to be seen as knowledgeable?</li>\n<li>Do I want to memorize Quran for Allah or to be called a Hafiz?</li>\n</ul>\n\n<h2>Summary and Key Takeaways</h2>\n<ul>\n<li>This hadith is the foundation of Islam - actions are judged by intentions</li>\n<li>The same action can be worship or worthless depending on intention</li>\n<li>Pure intention transforms ordinary activities into acts of worship</li>\n<li>We must constantly examine and purify our intentions</li>\n<li>Intention is in the heart - Allah sees what others cannot</li>\n<li>Seeking Allah's pleasure alone should be our goal in every action</li>\n</ul>\n\n<h2>Memorization Aid</h2>\n<p>Memorize this hadith in English and Arabic. It is short but comprehensive. Reflect on it before every major action in your life. Let it be a compass guiding all your decisions.</p>\n\n<div class=\"quote-box\" style=\"background: #f0f7f4; padding: 20px; border-radius: 8px; margin: 20px 0;\">\n<p style=\"font-style: italic; font-size: 1.1em;\">\"The greatest jihad is to battle your own soul, to fight the evil within yourself.\" - Prophet Muhammad ﷺ</p>\n</div>\n\n<h2>Next Lesson Preview</h2>\n<p>In the next lesson, we will study Hadith 2 about the levels of faith (Iman, Islam, and Ihsan) as taught by Angel Jibreel to the Prophet ﷺ. This hadith complements the first by teaching us the comprehensive structure of our religion.</p>",
        "video_url": null,
        "interactive_content": {
          "has_arabic_text": true,
          "has_hadith_authentication": true,
          "has_scholarly_commentary": true,
          "practical_applications": true,
          "memorization_aids": true
        },
        "learning_objectives": [
          "Memorize and understand the first hadith of Imam An-Nawawi's collection",
          "Recognize the central role of intention in all Islamic actions",
          "Distinguish between pure and corrupted intentions",
          "Transform daily activities into acts of worship through proper intention",
          "Identify and avoid showing off (riya') in good deeds",
          "Apply the principle of intention to modern American Muslim life",
          "Understand why scholars call this hadith 'half of knowledge'"
        ],
        "prerequisites": null,
        "is_free": true,
        "is_preview": true,
        "publishedAt": "2025-01-15T00:00:00.000Z"
      }
    ]
  }
}
